{
  "backend/main.mo": "Motoko canister managing chat sessions, user profiles, and authorization with logic for action messages and Puro’s auto-responses.",
  "feature_evidence.json": "Empty feature evidence report JSON placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files used as reference.",
  "frontend/index.css": "Global Tailwind CSS variables and themes for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component fetching caller profile and showing either profile setup or chat page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing.",
  "frontend/src/components/chat/ChatComposer.tsx": "Text input and send button handling Enter-to-send and action message detection.",
  "frontend/src/components/chat/ChatTranscript.tsx": "Renders chat messages or an empty-state prompt inviting the user to start.",
  "frontend/src/components/chat/MessageBubble.tsx": "Displays individual messages with styling for sender and action type.",
  "frontend/src/components/chat/PuroAvatar.tsx": "Avatar component rendering Puro’s image in multiple sizes.",
  "frontend/src/components/layout/ChatLayout.tsx": "Page layout with header, footer, and Puro branding.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for entering and saving a new user’s display name before chatting.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useGuestSessionId.ts": "Provides a memoized guest session ID using local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling auth-client setup, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile and chat operations using actor and session identity.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping it in query and identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Chat page fetching history, sending messages, handling errors, and managing scroll behavior.",
  "frontend/src/utils/guestSession.ts": "Utilities for creating, retrieving, and clearing guest session IDs using localStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines project state and requirements for an in-universe Puro roleplay chat app, including roleplay rules, features, UI expectations, and asset handling. Lists existing features, architectural notes, and metadata for build planning."
}