{
  "backend/main.mo": "Motoko actor managing chat sessions, user profiles, and permissions while generating Puro roleplay responses and parsing action messages ending with *.",
  "feature_evidence.json": "Metadata listing implemented features, associated files, components, and test identifiers for the project.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens and theming for light and dark modes in the chat UI.",
  "frontend/index.html": "Base HTML file loading the React app entrypoint and setting the page title.",
  "frontend/src/App.tsx": "Top-level React component handling authentication, profile gating, and rendering either login, profile setup, or the chat page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and cache clearing.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input component supporting Enter-to-send, Shift+Enter for newlines, and action detection when messages end with *.",
  "frontend/src/components/chat/ChatTranscript.tsx": "Scrollable transcript displaying message history or an empty-state prompt when no messages exist.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders individual chat messages with styling for sender type and action vs dialogue formatting.",
  "frontend/src/components/chat/PuroAvatar.tsx": "Avatar component showing Puro’s image in various sizes.",
  "frontend/src/components/layout/ChatLayout.tsx": "Layout wrapper providing header, footer, and consistent visual structure for the chat interface.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal that collects and saves the user's display name using a profile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Dfinity Internet Identity with stateful login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles and chat operations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base with theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Chat UI page that loads history, sends messages, handles errors, and manages scrolling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings, and loading typography, container-queries, and animate plugins.",
  "project_state.json": "JSON describing the project’s current state, features, pending requests, and metadata for an AI chat app centered on roleplaying as Puro."
}