{
  "backend/main.mo": "Motoko canister managing chat sessions, user profiles, permissions, and generating Puro responses with action parsing.",
  "feature_evidence.json": "Feature evidence metadata linking an avatar update request to the PuroAvatar component and related packages.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including chat components, layout, hooks, and styling.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and dark mode overrides for global theming.",
  "frontend/index.html": "Basic HTML entry point loading the main React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component controlling authentication, profile setup gating, and rendering the chat interface.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with loading and error handling.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input with textarea, Enter-to-send behavior, and action message indicator.",
  "frontend/src/components/chat/ChatTranscript.tsx": "Renders chat history or an empty-state prompt when no messages exist.",
  "frontend/src/components/chat/MessageBubble.tsx": "Displays chat messages with styling differences for Puro vs user and action vs dialogue.",
  "frontend/src/components/chat/PuroAvatar.tsx": "Avatar component showing the Puro image in various sizes with circular styling.",
  "frontend/src/components/layout/ChatLayout.tsx": "Layout wrapper providing header with Puro branding, main content area, and footer.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting users to enter their display name before accessing chat, with save handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout methods, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and chat messages through the actor API.",
  "frontend/src/index.css": "Sets Tailwind layers and theme variables for light and dark modes with custom color palettes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Implements the chat UI, loading history, sending messages, handling errors, and auto‑scrolling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session‑based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, containers, and plugins for the project.",
  "project_state.json": "Defines project metadata and features for an AI chat app that roleplays as Puro, including UI requirements, avatar assets, and action-parsing behavior."
}