{
  "backend/main.mo": "Main actor implementing chat sessions, Puro response generation, user profiles, guest-session routing, and authorization mixin integration.",
  "backend/migration.mo": "Migration module converting principal‑keyed chat and profile maps to text‑keyed versions for the new storage format.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for the guest‑mode update.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in the chat and guest‑session features.",
  "frontend/index.css": "Global Tailwind CSS variables and theming for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Top-level component loading the caller profile and showing a profile setup modal before rendering the chat page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and cache clearing.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer with textarea, Enter-to-send behavior, send button, and action message indicator.",
  "frontend/src/components/chat/ChatTranscript.tsx": "Scrollable message list rendering chat bubbles or an empty-state prompt.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders individual chat messages with Puro/user styling and action/dialogue formatting.",
  "frontend/src/components/chat/PuroAvatar.tsx": "Avatar component displaying Puro’s image in various sizes.",
  "frontend/src/components/layout/ChatLayout.tsx": "Provides the main chat page layout with header, footer, and children content slot.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting the user to enter a display name and saves it via a profile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useGuestSessionId.ts": "Returns a stable guest session ID using local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for loading and saving user profiles and sending/receiving chat messages.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme color variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page handling message history, sending messages, and displaying composer and transcript.",
  "frontend/src/utils/guestSession.ts": "Generates, stores, retrieves, and clears guest session IDs using localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store and retrieve them from sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and container settings for the app’s theme.",
  "project_state.json": "Defines the project’s state metadata, feature list, and requirements for an AI chat app roleplaying as Puro."
}