{
  "backend/main.mo": "Motoko actor managing chat sessions, user profiles, access control, and generating Puro responses with simple escape detection and pseudo‑random outcomes.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component that loads the user profile and shows either the setup modal or the chat page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state with loading feedback.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input with Enter‑to‑send, action detection via trailing asterisk, and a send button.",
  "frontend/src/components/chat/ChatTranscript.tsx": "Renders chat history or an empty-state prompt inviting the user to start chatting.",
  "frontend/src/components/chat/MessageBubble.tsx": "Displays individual messages with styling differences for Puro, user, and action types.",
  "frontend/src/components/chat/PuroAvatar.tsx": "Circular avatar component showing Puro's image in configurable sizes.",
  "frontend/src/components/layout/ChatLayout.tsx": "Page layout with header, footer, Puro branding, and share links.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting the user for their display name before entering the chat.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance, refreshing it when identity changes.",
  "frontend/src/hooks/useGuestSessionId.ts": "React hook returning a memoized guest session ID stored via getOrCreateGuestSessionId.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing identity loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading/saving user profiles and chat history and sending messages, using identity or guest session IDs.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark theme colors and layout.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and InternetIdentityProvider around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat page handling message history display, sending messages, and UI state like loading and errors.",
  "frontend/src/utils/guestSession.ts": "Utility to generate, store, retrieve, and clear guest session IDs using localStorage with UUID fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration with theme extensions, color variables, typography, container queries, and animations.",
  "project_state.json": "Defines project state for an AI roleplay chat app where the assistant fully roleplays as Puro, including architectural notes and existing features. Lists requirements for in-character behavior, action parsing, frontend UI, theming, and avatar assets."
}