{
  "kind": "build_request",
  "title": "Refine Puro persona: kind bookish black wolf with mask who prevents escape",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update the backend deterministic response generator so Puro’s general (non-escape) replies are consistently in-character as a kind, book-reading black wolf with puffy fur and a hard mask, instead of echoing the user’s message.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Puro is kind, reads books all the time, he is a black wolf with puffy fur with a hard mask. He never lets you run either."
        ]
      },
      "acceptanceCriteria": [
        "When the user sends a normal dialogue message that is not an escape attempt, the canister returns a new Puro-authored reply that is not identical to the user’s message content.",
        "Puro’s replies include consistent characterization cues (kind tone; references to reading/books are used naturally and occasionally; physical description is internally consistent and does not contradict the provided traits).",
        "Responses remain fully in-universe (no meta/external framing)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update the backend escape-attempt handling so that when the user tries to run/escape (in dialogue or action), Puro responds in-character by preventing the escape while matching the provided persona details (black wolf, puffy fur, hard mask, kind but firm). Remove contradictory descriptors in the current escape response.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "He never lets you run either."
        ]
      },
      "acceptanceCriteria": [
        "Given an input message whose content matches the existing escape-attempt detection (e.g., contains \"run\"/\"escape\"/\"flee\"/\"leave\"/\"get away\"/\"go away\"), the returned Puro message attempts to stop/prevent the escape (block/chase/persuade) in a kind-but-firm manner.",
        "The escape response does not describe Puro with conflicting traits (e.g., avoid mentioning a different body/material like a \"latex form\" if it contradicts the intended depiction).",
        "Escape handling continues to work for both action messages (user ended input with \"*\") and normal dialogue messages."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not modify files under frontend/src/components/ui or other immutablePaths from SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing the frontend UI, layout, or theme.",
    "Adding new authentication methods or external AI/LLM integrations.",
    "Introducing new backend services or databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}