{
  "kind": "build_request",
  "title": "Reduce Puro roleplay and shift assistant responses to a neutral chat style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the backend response generator so the assistant no longer strongly roleplays as Puro, producing neutral, helpful conversational replies instead of in-character mannerisms (e.g., remove roleplay stage directions like \"(tail wags)\" and immersion/roleplay framing like \"Puro sees you ...\"). Action messages (user text ending with \"*\") must still be recognized and handled, but the response should acknowledge the described action in a neutral way.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the roleplay chat not really roleplay to puro"
        ]
      },
      "acceptanceCriteria": [
        "Sending a normal dialogue message results in an assistant reply that does not include Puro roleplay mannerisms (e.g., no \"(tail wags)\"-style additions) and does not speak as a character roleplaying Puro.",
        "Sending an action message (a message ending in \"*\") is still stored as messageType=action (with the trailing \"*\" removed from stored content) and the assistant reply acknowledges the action content in a neutral style without immersion/roleplay exposition.",
        "The canister method signatures and stored ChatMessage schema remain compatible with the current frontend (no breaking candid/interface changes)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update user-facing copy in the chat UI to remove roleplay-first phrasing that encourages talking \"to Puro\" and instead present the experience as a general chat assistant while keeping the existing action-message hint (\"*\" at the end for actions).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the roleplay chat not really roleplay to puro"
        ]
      },
      "acceptanceCriteria": [
        "The empty state text no longer says \"Say hello to Puro!\" and is rewritten in English to invite a general conversation while still mentioning the \"*\" action convention.",
        "The header/subtitle text no longer positions the bot as an in-character roleplay companion (e.g., replace \"Your friendly companion\" with neutral wording such as \"Chat assistant\" or similar).",
        "No changes are made to any immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; add backend/migration.mo only if state/stable structure changes are required (not expected for this change).",
    "Keep the existing action parsing behavior: user messages ending with \"*\" must still be treated as actions and rendered as actions in the UI.",
    "Do not edit files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add third-party AI/LLM integrations.",
    "Do not change authentication/guest-session behavior.",
    "Do not remove the Puro avatar asset or redesign the entire UI theme beyond updating roleplay-oriented copy."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}