{
  "kind": "build_request",
  "title": "Make escape attempts usually blocked but occasionally successful in Puro roleplay",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Update the backend Puro response generator so that when the user attempts to run away/escape (in dialogue or in an asterisk-marked action), Puro usually tries to stop/prevent the escape in-character, but sometimes the user can successfully escape.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-10"
        ],
        "quotes": [
          "Puro tries not to let you leave, but sometimes you can escape."
        ]
      },
      "acceptanceCriteria": [
        "Given a message whose content matches the current escape-attempt detector (e.g., contains \"run\", \"escape\", \"flee\", \"leave\", \"get away\", or \"go away\"), the backend sometimes returns an escape-attempt response that indicates the user got away/escaped (in-universe), instead of always blocking.",
        "Across repeated escape-attempt messages in the same session, the outcome is not always the same (i.e., at least one attempt can succeed and at least one attempt can be blocked), without using any third-party services.",
        "Non-escape messages continue to produce in-character Puro responses and do not echo the user message verbatim."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Revise the backend escape-attempt response text to match the established Puro characterization (kind, book-reading black wolf with puffy fur and a hard mask) and remove contradictory descriptors currently used in the escape response.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-10"
        ],
        "quotes": [
          "Puro tries not to let you leave, but sometimes you can escape."
        ]
      },
      "acceptanceCriteria": [
        "The escape-attempt response no longer describes Puro as \"dark latex\" (or other contradictory descriptors) and instead aligns with: black wolf, puffy fur, hard mask, kind but firm.",
        "Escape-attempt responses remain fully in-universe (no meta/imagination framing) and can be expressed as action-style narration (#action) when appropriate.",
        "The backend continues to classify user messages ending with \"*\" as #action and strips the trailing asterisk before storing/responding, as it does now."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not introduce any third-party/hosted AI or external data stores.",
    "Use English for any user-facing text.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "No new frontend UI/UX changes are required for this update.",
    "No changes to authentication/guest session behavior.",
    "No schema/state migration unless it becomes strictly necessary (it is not expected for this change)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}