{
  "kind": "build_request",
  "title": "Align Puro persona and avatar with Puro from Changed (DragonSnow)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Update the backend Puro response generator so Puro’s replies consistently roleplay as Puro from the game “Changed” by DragonSnow (voice, mannerisms, characterization) instead of echoing the user message or using generic phrasing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the puro... Puro from changed by dragonsnow"
        ]
      },
      "acceptanceCriteria": [
        "When the user sends a normal dialogue message, the returned Puro message is not a verbatim echo of the user’s content.",
        "Puro responses are short, in-character, and consistently written from Puro’s perspective (not as a system narrator).",
        "Puro’s tone matches a friendly, curious lab-creature companion consistent with “Changed” characterization, without referencing external AI/system behavior."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Improve backend handling of action messages (messages entered by the user ending with “*”) so Puro responds in-character to the described action and does not use immersion-breaking language (e.g., avoid implying the action is “part of your imagination”).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the puro... Puro from changed by dragonsnow"
        ]
      },
      "acceptanceCriteria": [
        "When the user sends an action message (e.g., \"waves*\"), the stored user message has messageType=action and has the trailing asterisk removed from content (existing behavior preserved).",
        "Puro’s response acknowledges/reacts to the action in-character and remains messageType=dialogue.",
        "Puro’s action responses do not contain immersion-breaking phrases like “part of your imagination” or similar disclaimers."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the Puro avatar image to visually match Puro from “Changed” by DragonSnow, and update the frontend to use the updated avatar asset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the puro... Puro from changed by dragonsnow"
        ]
      },
      "acceptanceCriteria": [
        "A new or updated Puro avatar image asset exists under frontend/public/assets/generated.",
        "The PuroAvatar component displays the updated asset and still renders correctly at all supported sizes (sm/md/lg/xl).",
        "No user-facing text references anything other than “Puro” (English only)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify any files under frontend/src/components/ui or any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Store and reference static images from frontend/public/assets/generated (do not serve images from the backend)."
  ],
  "nonGoals": [
    "Adding third-party/hosted AI model integrations for responses.",
    "Changing authentication (Internet Identity) behavior.",
    "Adding real-time messaging (WebSockets) or multi-user chat rooms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Make the existing Puro avatar look like Puro from the game Changed: anthropomorphic wolf/dog-like creature, black/dark fur with white facial markings, expressive friendly eyes, subtle sci‑fi lab vibe, clean background (puro-avatar.dim_512x512.png > puro-avatar-changed.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}